import React from 'react';
import 'bootstrap/dist/css/bootstrap.css';

function hardwEightComponent() {
    return (
        <div>
            <h3>3D басып шығару түрлері</h3>
            <p>3D басып шығарудың бірнеше түрлі түрлері бар. FDM (FD тұндыру модельдеу) (Fd жіп жасау деп те аталады) балқытылған жіпті сайтқа экструдтайды және біз осы Нұсқаулықта назар аударатын ең көп таралған түрі болып табылады. SLA (стереолитография) және SLS (Ive лазерлік агломерациясы) - бұл пластмассаны 3D басып шығарудың екі нұсқасы, бірақ олар күрделі, қымбат немесе FTC қосымшаларында басқа кемшіліктерге ие. Осы себептерге байланысты олар ұсынылмайды. </p>
            <p>Металлға 3D басып шығару (SLS және басқалары) барған сайын қол жетімді бола бастады, бірақ бұл нұсқаулықтың шеңберіне кірмейді.</p>
            <p>3D басып шығарудың артықшылықтары</p>
            <li>3D басып шығару өлшемдерді реттеуге және тамаша оңтайландыруға мүмкіндік береді; мысалы, командалар оңтайлы жылдамдық үшін қажетті дәл диаметрлі катушканы немесе белгілі бір тістері бар белдік шкивін басып шығара алады.</li>
            <li>3D басып шығару командаларға жиынтықтар мен жеке бөліктер арасында оңай ауысуға мүмкіндік береді, өйткені барлық жиынтықтарда адаптивті бекітпелер немесе кронштейндер болмайды.</li>
            <li>Мұның тамаша мысалы-3D басып шығаруға арналған Nexus mecanum адаптерлері. 3D басып шығару командаларға өңдеу шектеулеріне байланысты алюминий сияқты материалдардан мүмкін емес бөлшектерді жасауға мүмкіндік береді.</li>
            <li>3D басып шығару командаларға сымдар мен қосылымдардан реттелетін кернеуді шығаруға мүмкіндік береді. Бұл үлкен жоба және сіздің уақытыңызға тұрарлық.</li>
            <p>3D басып шығарудың кемшіліктері </p>
            <li>Егер сізде жарыста 3D басып шығаруға арналған қосалқы бөлшектер таусылса, сізде сәттілік болмауы мүмкін. Командаларға жарыстың қосалқы бөлшектері ретінде 3D басып шығарылған әрбір жеке бөліктің кем дегенде бір жинағын басып шығару ұсынылады.</li>
            <li>3D басып шығарылған компоненттер алюминий сияқты басқа материалдарға қарағанда әлсіз болады. Дегенмен, дұрыс бағытта басып шығару өте тиімді болуы мүмкін-командаларда FRC® (жүз жиырма фунт) және FTC (қырық фунт) роботтарына қызмет көрсету үшін 3D басып шығару ілмектері және басқа бөлшектер бар.</li>
            <li>3D басып шығарылған бөліктерді тек бір бағытта жүктеу керек. Яғни, егер робот ілгекті іліп қойса, жалғыз жүктеме ілгектің қисық бөлігінің төменгі бетіне түсуі керек. Бөліктің істен шығуына жол бермеу үшін бүйірлік жүктемелерден мүмкіндігінше арылуға тырысыңыз. </li>
            <li>3D басып шығарылған бөліктердің өлшемі ПХД өлшеміне байланысты. Үлкен және қалың басып шығару көп уақытты қажет етеді (бір түнде) және апатқа әкелуі мүмкін. 3D басып шығару өте қымбатқа түсуі мүмкін, дегенмен жіптерді Amazon сияқты онлайн сатушылардан қолайлы бағамен табуға болады.</li>
            <p>Қарапайым жіптер</p>
            <p>FTC, PLA (немесе PLA, Pro және т.б.) және / немесе PETG үшін 3D басып шығарылуы керек әрбір дерлік бөлік үшін беріктік, беріктік және эстетика бойынша барлық талаптарды қанағаттандырады. Жіптің бұл екі түрін басып шығару ең оңай және көптеген өндірушілер қолайлы бағамен сатады. Мұнда ұсынылған басқа жіптердің көпшілігі күш, уақыт және ақша есебінен қол жеткізілетін ерекше артықшылықтарды ұсынады (сізді жақсы көріңіз).</p>
            <p>PLA (полилактикалық қышқыл)</p>
            <p>3D басып шығаруға арналған ең көп таралған жіп-полилактикалық қышқыл немесе PLA. Бұл жүгері крахмалы мен қант қамысы сияқты биологиялық көздерден жасалған пластик. PLA басқа жіп опцияларына қарағанда қатты, бірақ сынғыш материал болып табылады және басып шығару кезінде аздап деформацияға бейім. Ойын роботтың көптеген бөліктеріне жақсы сәйкес келеді, бірақ ол соққы жүктемелеріне (бөлшектерге соққыларға) төтеп бере алмайды, сондықтан мұндай бөліктер тиісті түрде жасалуы керек.</p>
            <li>PLA ыстық қондырғысының температура диапазоны 190 ° пен 230 ° C аралығында</li>
            <li>PLA қабатының температурасы 20 ° - тан 60 ° C-қа дейін өзгереді, бірақ PLA үшін қабатты жылыту қажет емес.</li>
            <p>PLA love немесе PLA Pro сияқты әртүрлі өндірушілер сататын көптеген PLAY нұсқалары бар. Бұл жіптер беріктігін, басып шығаруға жарамдылығын және басқа қасиеттерін жақсарту үшін әртүрлі қоспаларды қамтиды. Қымбат болғанына қарамастан, бұл өнімдер PLA өнімділігін едәуір арттырып, оның кемшіліктерін жаба алады.</p>
            <p>PETG (полиэтилентерефталат гликоль)</p>
            <p>PETG ойын үшін күштің жоғарылауы ретінде сипатталуы мүмкін. Оны басып шығару қиын емес, бірақ көбінесе тарылту және басқа да кішігірім артефактілер бар. Техникалық тұрғыдан PLA-ға қарағанда созылу күші аз болғанымен, ол әлдеқайда нәзік және сәл иілу кезінде соққыға жақсы төтеп бере алады. Бұл PLA-дан соққыға төзімді болу жеткіліксіз FTC бөлшектері үшін тамаша нұсқа. Оның жоғары температураға төзімділігі сонымен қатар ыстық көлік сияқты қоршаған ортаның жоғары температурасында деформацияланбайтынын білдіреді.</p>
            <li>PETG қыздыру температурасы 230 ° пен 260 ° C аралығында</li>
            <li>PETG қабатының температурасы 60°-80° C аралығында</li>
            <p>Аз қолданылатын жіптер</p>
            <p>Бұл жіптер жоғарыда аталғандарға қарағанда берік емес, бірақ FTC роботында көптеген жағдайларды анықтай алады. Олар әдетте икемділік немесе беріктік сияқты материалдың ерекше қасиеттеріне байланысты ерекшеленеді. Дегенмен, олар көбінесе кейбір принтерлердің оларды "қораптан" басып шығаруына жол бермейтін және кейде айтарлықтай қымбатқа түсетін айтарлықтай басып шығару кедергілерімен бірге келеді.</p>
            <p>ABS (акрилонитрилбутадиенстирол)</p>
            <p>ABSD PLAY коммерциялық қол жетімді болғанға дейін стандартты басып шығарылатын жіп болды. Сіз LEGO текшелерін ойнаған шығарсыз. Ол жоғары жүктемелерге төтеп бере алады және жеткілікті икемді. Бұл басып шығарудағы қиындықтарға байланысты, көбінесе қоршаған ортаның температурасын жоғарылату және бөлшектердің қатты деформациялануын болдырмау үшін корпус қажет. PETG-де ойнатумен салыстырғанда беріктікті жақсарту оңайырақ, сондықтан ABS бөлшектері FTC-де кең таралған емес. Алайда, ABS PLAY-мен бірдей бағамен сатылатын бағамен қол жетімді.</p>
            <li>ABS қыздыру температурасы 230 °-250 ° C аралығында өзгереді</li>
            <li>ABS қабатының температурасы 100°-120 ° C аралығында</li>
            <li>Деформацияны болдырмау үшін Корпус өте ұсынылады</li>
            <p>ABS басып шығарудың күрделілігіне және оның шектеулеріне байланысты ASA сияқты баламаларды қарастыруға болады, олар басып шығару мүмкіндігі әлдеқайда жақсы болған кезде ұқсас қасиеттерге ие.</p>
            <p>TPU/TPE (термопластикалық полиуретан / термопластикалық эластомер)</p>
            <p>TPU және TPE-бұл икемді материал қасиеттеріне байланысты кеңінен қолданылатын қарапайым баспа жіптері. Бұл оңай иілуге болатын бөлшектерді басып шығаруға мүмкіндік береді. Көптеген әртүрлі дюрометрлерден төмен сатылады (материалдың қаттылық / икемділік Шор шкаласы бойынша), TPU / TPE жоғары соққыға төзімділігі және қабаттардың адгезиясы оны әмбебап жіпке ғана емес, сонымен қатар өте берік етеді. The FTC TPU / TPE сияқты рөлдерде қолданылады баспа қабылдау клапандары құбыр кеңістігінде, сондай-ақ төмен жүктемені қолдану үшін тапсырыс бойынша жасалған белдіктер.</p>
            <li>TPU / TPE қыздыру температурасы 210 °-250 ° C аралығында</li>
            <li>TPU / TPE әдетте жылытылатын қабатты қажет етпейді, бірақ егер ол қолданылса, температура 60 ° C-тан аспауы керек, себебі бұл TPU-ны баспа қабатымен біріктіреді.</li>
            <li>TPU / TPE ауадан ылғалды көп сіңіреді, сондықтан оны басып шығарар алдында және басып шығару кезінде кептіру қажет болуы мүмкін.</li>
            <li>Тікелей жетекті экструдерді пайдалану ұсынылады</li>
            <p>Экзотикалық жіптер</p>
            <p>FTC-де бұл жіптерге қажеттілік сирек кездеседі. Олар жоғары жүктемелер мен қоршаған ортаның қолайсыз жағдайларына ұшырауы керек бөлшектер үшін өте жақсы материал қасиеттерін қамтамасыз етеді. Олардың барлығы жоғарыда аталған жіптердің кез келгеніне қарағанда әлдеқайда қымбат және басып шығару кезінде көптеген қиындықтар тудырады.</p>
            <p>Нейлон</p>
            <p>Нейлон жіптерін әйнекпен, көміртекті талшықпен немесе таза жіптермен толтыруға болады. Нейлонның соққыға төзімділігі соншалық, көптеген жағдайларда оның бір бөлігі толығымен сынудың орнына бүгілуі мүмкін. Кейде Нейлон беріліс қорабындағы доңғалақ төсемдері сияқты бөлшектер үшін және ол бірнеше рет соққылар мен мыжылған жерлерде қолданылады. Нейлон өте жоғары температураны қажет етеді, әдетте қабықты қажет етеді және оны басып шығарар алдында (және басып шығару кезінде) кептіру керек.</p>
            <li>Нейлонның қыздыру температурасы 240 ° - тан 260 ° C-қа дейін өзгереді</li>
            <li>Нейлон қабатының температурасы 55° - тан 80° C-қа дейін</li>
            <li>Нейлон ауадан ылғалды сіңірумен танымал және оны басып шығару алдында және басып шығару кезінде мұқият кептіру керек. Бұл талапты орындамау бөліктің іс жүзінде жарамсыз болып қалуына әкелуі мүмкін.</li>
            <li>Ұсынылған корпус</li>
            <p>Көміртекті талшықпен толтырылған</p>
            <p>Көптеген жіптер жіптің өзімен араласқан көміртекті талшықтың кішкене бөліктерімен бірге сатылады. Бұл жіптер көбінесе беріктікті арттырады деп есептелсе де, олар шын мәнінде қаттырақ болуы керек және нейлон жіптерінің басып шығару сапасын жақсартуға көмектесуі керек. Көміртекті талшықпен толтырылған жіптер әдетте жоғары температураны және қатайтылған Болат саптамаларды қажет етеді, бірақ егер сіз осы жіптердің таза нұсқаларын басып шығара алсаңыз, олардың көміртекті талшықпен толтырылған аналогтарын басып шығара аласыз.</p>
            <p>Поликарбонат (ДК)</p>
            <p>Поликарбонат және оның сорттары өте берік техникалық материалдар. ДК өте қатал болу және соққы жүктемелеріне өте жақсы төтеп беру қабілетімен жарқырайды. ДК сонымен қатар құрғақтықты, өте жоғары температураға төтеп бере алатын принтердің болуын және корпусты қажет етеді. Бұл басып шығару өте қиын материал және көбінесе өте қымбат. FTC - де поликарбонатты басып шығару бөлшектерін қажет етуге ешқандай себеп жоқ, өйткені оның беріктігін қажет ететін жағдайлар жоқ.</p>
            <p>Бірнеше ДК қоспалары бар, оларды басып шығару әлдеқайда оңай болуы мүмкін, жарқын мысал-PolyMaker polymax PC. Бұл таза компьютердің көптеген артықшылықтарын сақтайтын төмен температуралы басып шығару оңай компьютер. Полилит соққыға төзімді емес, бірақ әлдеқайда арзан. Екеуі де таза компьютерге қарағанда теру оңайырақ.</p>
            <li>ДК қыздыру температурасының диапазоны 250°-320 ° C</li>
            <li>ДК қабатының температурасы 80° - тан 140° C-қа дейін</li>
            <li>Қажетті қоршау</li>
            <li>Жіп құрғақ болуы керек</li>
            <p>Жоғары сапалы экзотикалық жіптер</p>
            <p>Өте жоғары артықшылықтарға ие және 3D басып шығару мүмкіндіктерін көрсететін бірнеше басқа материалдар бар, бірақ егер сіз басып шығару дағдыларыңызға сенімді болмасаңыз және FTC тәжірибесі аз болса, оларды басып шығаруға болмайды. Бұл материалдарға Delrin (гомополимер полиоксиметилен ацеталы), PEI (полиэфиримид, ultem бренді), PEEK (полиэфиркетон) және PEKK (Полиэфиркетонекетон) жатады, бірақ олармен шектелмейді. Бұл материалдар басып шығаруға өте берік, жоғары температураны қажет етеді (кейде шыңдалған болат саптама ери бастайды) және өте қымбат.</p>
            
        </div>
    );
}

export default hardwEightComponent;
