import React from 'react';
import 'bootstrap/dist/css/bootstrap.css';
import './index.css'




function InspTwoComponent() {
    return (
        <div>
        
<p>Ойын алаңы инспекцияның чеклисті</p>
<p>Drive командасының мүшелері қатысады</p>
<p>Ментор(міндетті), драйвер 1 (міндетті); драйвер 2 (міндетті емес)</p>
<p>Driver station және Robot Controller Hardware ережелері</p>
<p>Driver Station тек бір Android құрылғысынан тұрады (шеңбер): Motorola Moto G 2nd Generation, Motorola Moto G 3rd Generation, Motorola Moto G4 Play, Motorola Moto G5, Motorola G5 Plus, Motorola Moto E4, Motorola Moto E5, Motorola Moto E5 Play немесе REV Driver Hub.</p>
<p>Смартфон Робот контроллері Android құрылғысы (егер қолданылса) келесі модельдердің бірі (шеңбер): Motorola Moto G 2nd Generation, Motorola Moto G 3rd Generation, Motorola Moto G4 Play, Motorola Moto G5, Motorola G5 Plus, Motorola Moto E4, Motorola Moto E5, Motorola Moto E5 Play.  USB Interface Android құрылғысы тек REV Expansion Hub немесе USB hub-қа қосылады.
</p>
<p>Driver Station сенсорлық экраны қол жетімді және алаңдағы қызметкерлерге көрінеді.
</p>
<p>Driver Station екі рұқсат етілген геймпадтан (Logitech F310, Xbox 360, PS4 үшін сымды Sony DualShock 4, PS4 үшін сымды etpark контроллері) немесе кез келген комбинациядағы quadstick ойын контроллерінен тұрады.</p>
<p> Батареямен немесе батареясыз жұмыс істейтін бір (1) қосымша сыртқы USB hub - нан артық алу рұқсат етілмейді.
</p>
<p> USB-C REV driver Hub немесе Android смартфонына қосылған USB hub - қа қосылған бір ғана қосымша сыртқы COTS USB батареясы рұқсат етіледі.
</p>
<p>USB-C REV Driver Hub немесе USB hub(Android смартфонына қосылған) портына қосылған бір (1) қосымша сыртқы COTS USB батареясы рұқсат етіледі.</p>
<p>Driver Station Android смартфонының(егер қолданылса) USB интерфейсі тек Mini USB to OTG кабеліне немесе бір USB hub-қа қосылған кабельдердің комбинациясына немесе OTG Micro Adapter-ге қосылған бір USB геймпад кабеліне қосылады.</p>
<p>Driver Station Carrier (бар болса) талаптарға сәйкес келеді.
</p>
<p>Driver Station Android құрылғысы тек рұқсат етілген дыбыстарды ойнатады.
</p>
<p>Driver station(DS) және Robot Controller(RC) бағдарламалық жасақтама ережелері
Android смартфоны REV Driver Hub және REV Control Hub команданың ресми нөмірімен белгіленеді, содан кейін сәйкесінше-DS немесе –RC болады.
</p>
<p>Android операциялық жүйесі талаптарды қанағаттандырады: Motorola Moto G 2nd Generation, Motorola Moto G 3rd Genertion, Motorola Moto G4 play 6.0 немесе одан жоғары нұсқасы. Барлық басқа рұқсат етілген Android құрылғылары 7.0 немесе одан жоғары нұсқасы болып табылады.</p>
<p>DS және RC қосымшаларында 8.0 немесе одан жоғары нұсқасы бар, ал DS және RC қосымшаларында бірдей нұсқа нөмірлері болады. RC қосымшасы DS-ге орнатылмаған, ал DS қосымшасы RC-ге орнатылмаған.</p>
<p>REV Driver Hub операциялық жүйесі (егер қолданылса) 1.2.0 немесе одан жоғары нұсқасы.</p>
<p>REV Driver Hub-та (егер қолданылса) Bluetooth өшірілген және Wi-Fi қосылған.
</p>
<p>REV Control Hub (егер қолданылса) операциялық жүйесі 1.1.2 немесе одан жоғары нұсқасы, ал кірістірілген ПО нұсқасы 1.8.2 немесе одан жоғары.
</p>
<p>Микробағдарлама нұсқасы(firmware) REV Expansion Hub (егер қолданылса) - 1.8.2 немесе одан жоғары.
</p>
<p>REV Control Hub-та (егер қолданылса) Wi-Fi қосулы, Bluetooth өшірулі және құпия сөз "password" әдепкі мәнінен өзгеше.</p>
<p>Android смартфондар (егер олар қолданылса) ұшақ режиміне қойылады, Wi-Fi қосулы және Bluetooth өшірулі.</p>
<p>Android құрылғылары кез келген жергілікті желілерге қосылмаған.
</p>
<p>Android құрылғыларындағы барлық сақталған Wi-Fi Direct Group және Wi-Fi connectors өшірілген.</p>
<p>Робот пен Driver Station арасындағы байланыс тек RC және DS қосымшалары арқылы жүзеге асырылады. Одан тыс байланысқа рұқсат етілмейді.</p>
<p>Driver Station роботты басқару үшін ресми FTC Driver Station қолданбасын пайдаланады.</p>
<p>Android смартфонындағы FTC Robot Controller қосымшасы (егер қолданылса) әдепкі бағдарлама болып табылады, бағдарлама іске қосылады және басқа хабарламалар пайда болмайды.</p>
<p>Робот контроллері дұрыс Wi-Fi арнасына қосылған (егер жарыс талап етсе).</p>
<p>Роботтың жұмысы ойын алаңында тексерілді</p>
<p>Робот контроллері Driver Station-ға қосылады.</p>
<p>Робот автономдық жұмыс пен драйвер басқаратын жұмыс арасында дұрыс ауысады.</p>
<p>Робот Driver Station командасы бойынша іске қосылады және тоқтайды.</p>
<p>Егер төре оған нұсқау берсе, команда роботты қалай өшіру керектігін біледі.</p>
<p>Ойын алаңында ұсынылған кезектілік процесі туралы ақпарат
Команда Queue Area-да бағдарламалық жасақтаманы өзгертуге рұқсат етілмейтінін түсінеді.
</p>
<p>Команда матч кестесі тек өрескел ақпарат екенін түсінеді. Матчтар жоспарланған уақытқа дейін немесе одан кейін басталуы мүмкін. Кестенің өзгеруін қадағалау және қажет болған жағдайда пайда болу команданың жауапкершілігі болып табылады.
Команда жарыс ойын алаңына жетпес бұрын роботтың екі жағында өз командасының Альянс маркерін бекітуге жауапты екенін біледі.
</p>

         
        </div>
    );
}

export default InspTwoComponent;
