import React from 'react';
import 'bootstrap/dist/css/bootstrap.css';
import './index.css'




function DocSevenComponent() {
    return (
        <div>
          <h3>Инженерное портфолио</h3>
          <p>Что такое Инженерное портфолио?</p>
          <p>Инженерное портфолио - это краткое и лаконичное изложение инженерного пути команды на протяжении всего сезона. Инженерное портфолио должно включать эскизы, обсуждения и встречи команды, эволюцию дизайна, процессы, препятствия, цели и планы по освоению новых навыков, а также краткие мысли каждого члена команды на протяжении всего путешествия в течение сезона. Инженерное портфолио похоже на резюме команды.</p>
          <p>Одна из целей FIRST и FIRST Tech Challenge состоит в том, чтобы распознать процесс инженерного проектирования и путешествие, которое совершает команда. Это путешествие включает в себя этапы определения проблемы, концептуального проектирования, проектирования на системном уровне, детального проектирования, тестирования и верификации, а также производства робота.</p>
          <p>Форматы инженерного портфолио</p>
          <p>Команды могут документировать свое итоговое портфолио либо рукописными, либо электронными документами. Во время судейства не проводится различие между рукописными и электронными инженерными портфолио; каждый формат одинаково приемлем.</p>
          <p>a) Электронный: Команды могут выбрать использование любых электронных программ для создания своего инженерного портфолио.</p>
          <p>Для удаленного судейства командам необходимо создать единый PDF-файл своего инженерного портфолио.</p>
          <p>Для традиционных мероприятий команды должны распечатать свое инженерное портфолио.</p>
          <p>б) Рукописный: Команды могут выбрать создание рукописной версии.</p>
          <p>Для событий с удаленным судейством это не рекомендуется из-за трудностей при сканировании в читаемую, онлайн, доступную для совместного использования.</p>
          <p>Требования к инженерному портфолио</p>
          <p>1. Чтобы претендовать на присуждение наград жюри, команда должна представить инженерное портфолио.</p>
          <p>a) Команды, которые не представят инженерное портфолио, не будут рассматриваться для присуждения наград жюри.</p>
          <p>2. Общее количество страниц инженерного портфолио не должно превышать 15 страниц (с титульным листом общий объем составляет 16 страниц).</p>
          <p>Номер команды в верхней части каждой страницы позволяет судьям легко узнать, кто создал инженерное портфолио, которое они рассматривают. Номер команды на первой странице является обязательным компонентом инженерного портфолио.</p>
          <p>a) Титульный лист может содержать информацию о команде и оглавление.</p>
          <p>б) Титульный лист может не содержать другое содержимое инженерного портфолио.</p>
          <p>i. Дополнительный контент на титульном листе увеличивает количество страниц портфолио, что означает, что контент на последней странице портфолио не будет рассмотрен.</p>
          <p>c) Страницы должны быть эквивалентны бумаге стандартного формата A (США 8,5 x 11) или бумаге стандартного формата A4 (ЕС 210 x 297 мм).</p>
          <p>d)Минимальный размер используемых шрифтов: 10. Пожалуйста, избегайте использования узких шрифтов, так как судьям может быть трудно их прочитать.</p>
          <p>e) Судьям предписывается просматривать только титульный лист и первые 15 страниц содержания, которые следуют за титульным листом. Информация, включенная за пределы 15 страниц и титульного листа, не будет рассмотрена.</p>
          <p>3. Инженерное портфолио не должно содержать ссылок на другие документы, видео или любой другой дополнительный контент.</p>
          <p>a) Пожалуйста, обратите внимание, что судьи не будут просматривать другой контент в инженерном портфолио, включая веб-сайты или видео.</p>
          <p>4. Форма подачи заявки на получение Control Award не является частью инженерного портфолио и не включена в общее количество страниц инженерного портфолио.</p>
          <p>Рекомендации по инженерному портфолио</p>
          <p>1. Мы настоятельно рекомендуем указывать номер команды вверху каждой страницы.</p>
          <p>Рекомендуем связать критерии присуждения наград с конкретным контентом в вашем инженерном портфолио!</p>
          <p>2. Инженерное портфолио может включать:</p>
          <p>a) Краткое изложение инженерного содержания, включающего процессы проектирования роботов.</p>
          <p>б) Краткое изложение информации о команде, включающее информацию о команде и его информационно-стимулирующих мероприятиях.</p>
          <p>c) Краткое изложение плана команды и информация о команде в целом. Командный план может быть бизнес-планом, планом сбора средств, стратегическим планом, планом устойчивого развития или планом получения новых навыков.</p>
        </div>
    );
}

export default DocSevenComponent;
