import React from 'react';
import 'bootstrap/dist/css/bootstrap.css';

function hardwTenComponent() {
    return (
        <div>
            <h3>Компьютерное проектирование (CAD)</h3>
            <p>CAD - это программное обеспечение, наиболее часто используемое для облегчения проектирования деталей и сборок в машиностроении. В FTC CAD используется для создания 3D-моделей роботов, а также для проектирования пользовательских деталей.</p>
            <p>Иногда CAD может быть вообще не важен. Существует большое количество вариантов создания роботов без CAD. Вы также можете свободно создавать 3D-модели только частей робота (интейк, лифт, колеса и т.д). Однако у нас есть 4 причины, по которым вам следует использовать CAD-модели в процессе проектирования робота FTC.</p>
            <p>1.CAD решает множество проблем, связанных с предотвращением, таких как проблемы с интервалами. Таким образом, это спасет время, когда вы обнаружите проблемы в CAD, которые сможете устранить до того, как создадите своего робота.</p>
            <p>2.CAD - это профессиональный инструмент, который используется во многих областях применения. Владение информацией и навыками CAD будет благоприятствовать вашей будущей карьере, если вы будете учиться и работать в этих областях.</p>
            <p>3.Если вы хотите напечатать детали на 3D-принтере или механической обработке, для этого потребуется CAD.</p>
            <p>4.CAD может снизить затраты на сборку робота, помогая определить, какие детали вам необходимы для робота, прежде чем фактически тратить деньги на покупку этих деталей.</p>
            <p>Однако CAD - это не волшебный джинн, который гарантирует вам успех в FTC. При правильном использовании это отличный инструмент, помогающий командам создавать своих роботов. Однако имейте в виду, что многие команды добились успеха и без CAD.</p>
            <p>Для начала выберите программу CAD и разберитесь в ней как можно лучше. Возможно, было бы отличной идеей потратить несколько недель на то, чтобы просто найти валявшиеся поблизости предметы, сесть за линейку или штангенциркуль и создать быструю CAD-модель. Отличный способ проверить точность - выбрать твердый объект, изготовленный из одного известного материала. Взвесьте объект и создайте модель в CAD, примените к нему этот материал и посмотрите, каково расхождение в весе. Это отличный способ проверить, насколько модель CAD соответствует подлинной детали. На самом деле не имеет значения, что это за объект - просто откройте для себя что-то и создайте это в меру своих способностей. На YouTube также есть множество видеороликов; отличный из них - TFI, который создает подробные руководства для Autodesk Inventor.</p>
            <p>CAD программы, которые вы можете использовать</p>
            <p>Существует множество возможных программ CAD, которые могут освоить команды, и все они могут быть загружены бесплатно по лицензии learner или FTC team. Здесь вам придется провести небольшое исследование, поскольку требования к бесплатным копиям варьируются в зависимости от программы. Вот пара предложений, которые следует рассмотреть:</p>
            <p>SolidWorks</p>
            <p>Стандартный пакет CAD, разработанный компанией Dassault Systemes. Это настолько полнофункциональное программное обеспечение, насколько это возможно в CAD, включая великолепные функции моделирования и очень мощную среду сбора данных. Она широко используется в промышленности, а также является предпочтительной программой для большинства инженерных курсов на уровне колледжа. Однако он недоступен для Mac rs, и для его запуска вам понадобится красивый мощный компьютер (16 ГБ оперативной памяти входит в стандартную комплектацию).</p>
            <p>SolidWorks также поставляется с программой solid simulation, если вы хотите протестировать конструктивные свойства вашего робота или детали, разработанной по индивидуальному заказу. Если у вас есть наставники или члены команды с предыдущим опытом работы в SolidWorks или в инженерном классе вашей школы, где преподают SolidWorks, это будет ваш лучший выбор.</p>
            <p>Creo</p>
            <p>Семейство приложений CAD/CAM, разработанных PTC (Parametric Technology Corporation). Creo parametric - это основной пакет CAD, который включает в себя строгий сбор и моделирование деталей по аналогии с Solidworks.</p>
            <p>Главное преимущество Creo по сравнению с другими программами CAD заключается в сложных соотношениях частей и ограничениях, однако большинство новых РС обнаруживают, что этот аспект трудно понять полностью. Пакет Creo включает в себя интегрированный механизм локального рендеринга и систему тщательного моделирования. Механизм рендеринга может быть расширен для фотореалистичных рендеров чего угодно - от обычных однокомпонентных до многокомпонентных сложных конструкций. Усовершенствования дизайна могут быть непосредственно интегрированы в моделирование материалов/ геометрии деталей в Creo Simulate.</p>
            <p>Creo обладает множеством функций, но применяется общее правило "восемьдесят на двадцать" - 20 процентов функций будут соответствовать 80 процентам дизайна. Пакет Creo также включает в себя систему обмена файлами Windchill, основанную на версии, которая доступна большинству профессиональных компаний, но для целей FTC будет достаточно Grabcad.</p>
            <p>Изучение Creo может оказаться более сложной задачей, чем другого программного обеспечения CAD, из-за множества доступных онлайн-руководств в дополнение к сложной структуре связей и ограничений. Мы рекомендуем запомнить Creo кому-то, у кого уже есть опыт работы с программным обеспечением.</p>
            <p>Инженерные классы на уровне колледжа, а также многочисленные компании в автомобильной, аэрокосмической и потребительской промышленности Creo. Поскольку Creo использует файловую систему ОС Windows, он не будет работать на Mac. Однако для запуска Creo на Mac можно установить эмулятор Windows.</p>
            <p>Fusion 360</p>
            <p>Облачный пакет CAD/CAM "все в одном", также созданный Autodesk. Fusion three hundred sixty совместим с кросс-платформой, хотя и не очень хорошо работает на компьютерах с низкой спецификацией. Это мощная среда CAD для обработки ваших деталей, а также интуитивно понятный и простой облачный рендеринг, который облегчает работу серверов Autodesk. </p>
            <p>Чтобы поддерживать более простой пользовательский интерфейс, Fusion не использует многие более продвинутые функции, найденные в SolidWorks и Inventor, хотя на самом деле это не представляет большой проблемы.</p>
            <p>Однако более примечательное разногласие заключается в том, что Fusion игнорирует каждый отдельный отраслевой стандарт, создавая свою собственную структуру и организационную систему. Помимо обычных эскизов и функций выдавливания, система моделирования и сбора данных Fusion уникальна и не совместима ни с каким другим программным обеспечением CAD, что затрудняет отказ от Fusion. </p>
            <p>Из-за этого, если вы не будете осторожны, файловая иерархия Fusion может активно поощрять ужасные дизайнерские привычки и препятствовать повторному использованию, позволяя создавать новые части без предварительного их индивидуального проектирования. Если кто-то стремится к превосходному дизайну, Fusion - это надежный вариант.</p>
            <p>Onshape</p>
            <p>Полнофункциональный пакет CAD, но он полностью работает в облаке. Он может работать на любом компьютере (даже на хромбуках!), а также имеет приложения для iOS, iPad OS и Android. Это все те же основные функции, что и SolidWorks и Inventor, а также лучший в отрасли рабочий процесс совместной работы - многие люди называют его “Google Docs of CAD”. </p>
            <p>Onshape позволяет нескольким людям работать над одним и тем же документом одновременно и позволяет пользователям “следить” друг за другом и видеть, что находится на экране другого пользователя. В On Shape также есть Feature Script, язык программирования, на котором вы можете писать пользовательские функции. </p>
            <p>Сообщество уже разработало множество полнофункциональных скриптов, которые вы можете использовать совершенно бесплатно. Onshape также имеет комплексную систему обучения (https://learn.onshape.com ), которые научат вас не только пользоваться их программным обеспечением, но и подходить к проблемам проектирования. Если вы только начинаете работать с CAD или у вас нет доступа к мощным компьютерам, Onshape - это программное обеспечение для вас.</p>
            <p>Inventor</p>
            <p>Промышленное предложение Autodesk в области САПР. Он предлагает множество функций, схожих с SolidWorks, но имеет другой пользовательский интерфейс и три различных режима сбора данных. Несмотря на то, что он используется многими компаниями отрасли, он не фигурирует в очень многих учебных программах колледжей. Inventor, как правило, является вторым выбором для компаний, которые не используют SolidWorks, а вместо этого базируются на Autodesk universe. Inventor также недоступен для Mac, но он может работать лучше на ПК с более низкими характеристиками. Если у вас есть наставники или члены команды с предыдущим опытом работы в Inventor или в инженерном классе вашей школы, где преподают Inventor, это будет ваш лучший выбор.</p>
            <p>Где брать примеры?</p>
            <p>Все поставщики (REV, goBILDA, Actobotics, AndyMark, Tetrix) предоставляют третьи модели деталей, которые они продают, в формате STEP, которые могут быть импортированы любой из приведенных выше CAD-программ. Некоторые поставщики также предлагают репозитории или zip-файлы, содержащие пошаговый файл всех моделей, которые они продают.</p>
            <p>Ссылки для вас:</p>
            <li>Actobotics (ServoCity)</li>
            <li>REV Robotics</li>
            <li>10650 Hamzat Robotics CAD Library</li>
            <li>FTC Onshape Parts Library (contains a majority of parts from most major vendors)</li>
            <p>Как обмениваться файлами?</p>
            <p>Команды часто состоят из нескольких человек, работающих над моделями САПР, и поэтому им требуется система обмена файлами для обеспечения того, чтобы у каждого человека были актуальные файлы. Некоторые рекомендации включают GrabCAD, Box, Google Drive или box. Также отличная идея, чтобы один член команды работал над моделью одновременно, чтобы избежать путаницы.</p>
            
        </div>
    );
}

export default hardwTenComponent;
