import React from 'react';
import 'bootstrap/dist/css/bootstrap.css';

function hardwSixComponent() {
    return (
        <div>
            <h3>Компьютерлік модель (CAD)</h3>
            <p>CAD - бұл робот бөлшектерін мен құрылымдарды жобалауды жеңілдету үшін жиі қолданылатын бағдарламалық жасақтама. FTC роботтардың 3D модельдерін жасау үшін, сондай-ақ құрылысқа қажет бөлшектерді жобалау үшін қолданылады.</p>
            <p>Кейде CAD мүлдем маңызды болмауы мүмкін. CAD жоқ роботтарды жасаудың көптеген нұсқалары бар. Сондай-ақ, сіз тек Робот бөліктерінің 3D модельдерін (интейк, дөңгелектер, лифт және т.б.) еркін жасай аласыз. Дегенмен, бізде FTС байқауына дайындалу процесінде СAD үлгілерін пайдаланудың 4 себебі бар.</p>
            <p>1.CAD алдын алуға байланысты көптеген мәселелерді шешеді, мысалы, аралық мәселелер. Осылайша, бұл сіздің роботыңызды жасамас бұрын шешуге болатын CAT-та ақауларды тапқан уақытты үнемдейді.</p>
            <p>2.CAD - бұл көптеген қолданбаларда қолданылатын кәсіби құрал. Егер сіз осы салаларда оқып, жұмыс жасасаңыз, CAD туралы ақпарат пен дағдыларды меңгеру сіздің болашақ мансабыңызға қолайлы болады.</p>
            <p>3.Егер сіз бөлшектерді 3D басып шығарғыңыз келсе немесе өңдегіңіз келсе, оған CAD қажет болады.</p>
            <p>4.CAD роботты құрастыру шығындарын төмендетуі мүмкін, бұл сізге осы бөлшектерді сатып алуға ақша жұмсамас бұрын робот үшін қандай бөлшектер қажет екенін анықтауға көмектеседі.</p>
            <p>Дегенмен, CAD FTC-де табысқа жетуге кепілдік беретін сиқырлы зат емес. Дұрыс пайдаланыс кезінде CAD - командаларға роботтарын жасауға көмектесетін тамаша құрал. Дегенмен, көптеген командалар CAD-сыз да биік нәтижелерге жеткенің есте сақтаңыз.</p>
            <p>Бастау үшін CAD бағдарламасын таңдап, оны қолдануға мүмкіндігінше тез үйреніп алыңыз. Жақын жерде жатқан заттарды тауып қолдануға және жылдам CAD үлгісін жасауға бірнеше апта жұмсау тамаша идея болуы мүмкін. Дәлдікті тексерудің тамаша тәсілі - белгілі бір материалдан жасалған қатты затты таңдау. Нысанды өлшеп, CAD-да модель жасаңыз, оған осы материалды қолданыңыз және салмақтың сәйкессіздігі қандай екенін көріңіз. Бұл CAD моделінің шынайы бөлікке қаншалықты сәйкес келетінін тексерудің тамаша тәсілі. Объекттің тек бастапқы келбетіне бейімделмеңіз.Керісінше бірнеше нұсқаулық құрып, анализ жасаңыз. YouTube-те көптеген бейнелер бар; олардың керемет бөлігі - Autodesk Inventor үшін егжей-тегжейлі нұсқаулықтар жасайтын TFI.</p>
            <p>Сіз пайдалана алатын CAD бағдарламалары</p>
            <p>SolidWorks</p>
            <p>Dassault Systemes жасаған стандартты CAD пакеті. Бұл CAD-де мүмкіндігінше толық бағдарламалық жасақтама, соның ішінде керемет модельдеу мүмкіндіктері және өте қуатты деректер жинау ортасы. Ол өнеркәсіпте кеңінен қолданылады, сонымен қатар колледж деңгейіндегі инженерлік курстардың көпшілігі үшін таңдаулы бағдарлама болып табылады. Дегенмен, Бұл Mac RS үшін қол жетімді емес және оны іске қосу үшін сізге жақсы қуатты компьютер қажет (16 ГБ жедел жады стандартты болып табылады).</p>
            <p>Егер сіз роботтың дизайн қасиеттерін немесе тапсырыс бойынша жасалған бөлшектерді тексергіңіз келсе, SolidWorks сонымен қатар solid simulation бағдарламасын қолдана аласыз. Егер сізде SolidWorks немесе SolidWorks оқытатын мектептің инженерлік сыныбында бұрынғы тәжірибесі бар тәлімгерлер немесе топ мүшелері болса, бұл сіздің ең жақсы ставкаңыз болады.</p>
            <p>Creo</p>
            <p>PTC (Parametric Technology Corporation) әзірлеген CAD/CAM қосымшалар тобы. Creo parametric - бұл Solidworks-қа ұқсас бөлшектерді қатаң жинау мен модельдеуді қамтитын негізгі CAD пакеті.</p>
            <p>Creo-ның басқа CAD бағдарламаларына қарағанда басты артықшылығы-күрделі бөлік қатынасы мен шектеулері, дегенмен, жаңа MS-тің көпшілігі бұл аспектіні толық түсіну қиын деп санайды. Creo пакеті біріктірілген Жергілікті көрсету механизмін және мұқият модельдеу жүйесін қамтиды. Рендеринг механизмін қарапайым бір компоненттен көп компонентті күрделі құрылымдарға дейін кез келген нәрсенің фотореалистік рендерингтері үшін кеңейтуге болады. Дизайнды жетілдіруді Creo Simulate-те материалдарды/ бөлшектер геометриясын модельдеуге тікелей біріктіруге болады.</p>
            <p>Creo-да көптеген мүмкіндіктер бар, бірақ жалпы сексен - жиырма ережесі қолданылады-мүмкіндіктердің 20 пайызы дизайнның 80 пайызына сәйкес келеді. Creo пакеті сонымен қатар көптеген кәсіби компанияларға қол жетімді нұсқаға негізделген Windchill файл алмасу жүйесін қамтиды, бірақ FTC мақсаттары үшін grabcad жеткілікті болады.</p>
            <p>Creo-ны үйрену басқа CAD бағдарламалық жасақтамасына қарағанда қиынырақ болуы мүмкін, өйткені күрделі байланыс құрылымы мен шектеулерден басқа көптеген онлайн оқулықтар бар. Бағдарламалық жасақтамамен тәжірибесі бар адамға Creo-ны есте сақтауды ұсынамыз.</p>
            <p>Колледж деңгейіндегі инженерлік сыныптар, сондай-ақ Creo автомобиль, аэроғарыш және тұтыну өнеркәсібіндегі көптеген компаниялар. Creo Windows ОЖ файлдық жүйесін қолданатындықтан, ол Mac жүйесінде жұмыс істемейді. Дегенмен Mac жүйесінде Creo іске қосу үшін Windows эмуляторын орнатуға болады.</p>
            <p>Fusion 360</p>
            <p>Autodesk жасаған CAD/CAM бұлтқа негізделген барлығы бір пакет. Fusion three hundred sixty кросс-платформамен үйлесімді, бірақ ол техникалық сипаттамалары төмен компьютерлерде жақсы жұмыс істемейді. Бұл сіздің бөлшектеріңізді өңдеуге арналған қуатты CAD ортасы, сонымен қатар Autodesk серверлерінің жұмысын жеңілдететін интуитивті және қарапайым бұлтты көрсету.</p>
            <p>Қарапайым пайдаланушы интерфейсін сақтау үшін Fusion SolidWorks және Inventor-да табылған көптеген жетілдірілген мүмкіндіктерді пайдаланбайды, бірақ бұл үлкен мәселе емес.</p>
            <p>Алайда, ерекше келіспеушілік-Fusion өзінің құрылымы мен ұйымдастырушылық жүйесін құра отырып, әрбір жеке салалық стандартты елемейді. Кәдімгі эскиздер мен экструзия мүмкіндіктерінен басқа, Fusion модельдеу және деректерді жинау жүйесі бірегей және басқа CAD бағдарламалық жасақтамасымен үйлесімді емес, бұл Fusion-дан бас тартуды қиындатады.</p>
            <p>Осыған байланысты, егер абай болмасаңыз, Fusion файлдық иерархиясы қорқынышты дизайн әдеттерін белсенді түрде ынталандыруы және қайта пайдалануға кедергі келтіруі мүмкін, бұл жаңа бөліктерді алдын-ала жобалаусыз жасауға мүмкіндік береді. Егер біреу керемет дизайнға ұмтылса, Fusion - бұл сенімді нұсқа.</p>
            <p>Onshape</p>
            <p>Толық функционалды CAD пакеті, бірақ ол толығымен бұлтта жұмыс істейді. Ол кез-келген компьютерде жұмыс істей алады (тіпті хромбуктарда да!), сонымен қатар iOS, iPad OS және Android қосымшалары бар. Бұл SolidWorks және Inventor сияқты негізгі мүмкіндіктер, сонымен қатар саладағы ең жақсы бірлескен жұмыс процесі - көптеген адамдар оны "Google Docs of CAD"деп атайды.</p>
            <p>Onshape бірнеше адамға бір құжатта бір уақытта жұмыс істеуге мүмкіндік береді және пайдаланушыларға бір-бірін "қадағалап", басқа Пайдаланушының экранында не бар екенін көруге мүмкіндік береді. On Shape-те Feature Script, бағдарламалау тілі бар, онда сіз арнайы функцияларды жаза аласыз. </p>
            <p>Қауымдастық қазірдің өзінде сіз толығымен тегін пайдалана алатын көптеген толық сценарийлерді әзірледі. Onshape-те кешенді оқыту жүйесі бар (https://learn.onshape.com ), бұл сізге олардың бағдарламалық жасақтамасын пайдалануды ғана емес, сонымен қатар дизайн мәселелеріне жақындауды үйретеді. Егер сіз CAD - пен жұмыс істей бастасаңыз немесе қуатты компьютерлерге қол жеткізе алмасаңыз, Onshape - бұл сізге арналған бағдарламалық жасақтама.</p>
            <p>Inventor</p>
            <p>AutoDesk-тің CADs саласындағы өнеркәсіптік ұсынысы. Ол SolidWorks-қа ұқсас көптеген мүмкіндіктерді ұсынады, бірақ әртүрлі пайдаланушы интерфейсі және үш түрлі деректерді жинау режимі бар. Оны саланың көптеген компаниялары қолданғанымен, ол көптеген колледждердің оқу бағдарламаларында кездеспейді. Inventor әдетте SolidWorks қолданбайтын, оның орнына Autodesk universe-ке негізделген компаниялар үшін екінші таңдау болып табылады. Inventor Mac үшін де қол жетімді емес, бірақ ол төмен сипаттамалары бар компьютерлерде жақсы жұмыс істей алады. Егер сізде бұрын Inventor немесе inventor оқытатын мектептің инженерлік сыныбында тәжірибесі бар тәлімгерлер немесе топ мүшелері болса, бұл сіздің ең жақсы ставкаңыз болады.</p>
            <p>Мысалдарды қай жерден алуға болады?</p>
            <p>Барлық жеткізушілер (REV, GOBILDA, Actobotics, AndyMark, Tetrix) сатылатын бөлшектердің үшінші модельдерін STEP форматында ұсынады, оларды жоғарыдағы CAD бағдарламаларының кез келгені импорттай алады. Кейбір провайдерлер сатылатын барлық модельдердің қадамдық файлы бар репозиторийлерді немесе zip файлдарын ұсынады.</p>
            <p>Қажетті сілтемелер:</p>
            <li>Actobotics (ServoCity)</li>
            <li>REV Robotics</li>
            <li>10650 Hamzat Robotics CAD Library</li>
            <li>FTC Onshape Parts Library (contains a majority of parts from most major vendors)</li>
            <p>Файлдармен қалай бөлісуге болады?</p>
            <p>Командалар көбінесе CAD модельдерінде жұмыс істейтін бірнеше адамнан тұрады, сондықтан әр адамның өзекті файлдарға ие болуын қамтамасыз ету үшін файлдарды бөлісу жүйесі қажет. Кейбір ұсыныстарға GrabCAD, Box, Google Drive немесе box кіреді. Сондай-ақ, команданың бір мүшесін шатастырмау үшін модельде бір уақытта жұмыс істеуге тамаша идея.</p>
          
        </div>
    );
}

export default hardwSixComponent;
