import React from 'react';
import 'bootstrap/dist/css/bootstrap.css';
import './index.css'




function InspOneComponent() {
    return (
        <div>
        
<p>Роботты тексеруге арналған тізім</p>
<p>Робот өлшемдерін тексеру</p>
<p>Робот тексеруге барлық механизмдермен (әр механизмнің барлық компоненттерін қоса), роботта болатын конфигурациялармен және жиынтықтармен ұсынылуы керек.</p>
<p>Роботты барлық бірегей бастапқы(матч алдындағы) конфигурацияларында бөлек тексеріңіз. Робот Sizing Tool бүйірлері мен үстіңгі жағына шамадан тыс күш жұмсамағанда сәйкес келеді.</p>
<p>Роботты инициализациялау кезінде сервомоторлар қозғалса, Robot Motion Warning Label бекітіледі.</p>
<p>Роботқа арналған жалпы ережелер</p>
<p>Роботта ойын алаңын немесе басқа роботтарды зақымдай алатын компоненттер болмауы керек.</p>
<p>Роботта қауіпті материалдар болмауы керек.</p>
<p>Робот қажет емес тосқауыл қаупін тудырмауы керек.</p>
<p>Роботта өткір жиектер немесе бұрыштар болмауы керек.</p>
<p>Роботта жануарлардан алынатын материалдар, сұйық немесе гельдік материалдар болмауы керек.</p>
<p>Роботта босатылған жағдайда ойынның кешігуіне әкелуі мүмкін материалдар болмауы керек.</p>
<p>Роботта роботтың жақтауын ойын алаңына электрлік негіздейтін элементтер болмауы керек.</p>
<p>Роботта жабық газ, гидравликалық және вакуумдық құрылғылар болмауы керек.</p>
<p>Команда нөмірі кем дегенде 2 қарама-қарсы жақтан көрінуі керек және талаптарға сай болуы керек.</p>
<p>Alliance Markers бар және талаптарға сәйкес келеді.</p>
<p>Робот пайдаланатын энергия тек мақұлданған көздерден алынуы керек.</p>
<p>Робот өзінің өзі компоненттерін ажырата алмайды.</p>
<p>Роботтың механикалық бөліктері мен материалдарының ережелері</p>
<p>Роботтың барлық компоненттері рұқсат етілген шикізаттан және коммерциялық дайын өнімдерден жасалған.</p>
<p>Роботтың электрлік бөлшектері мен материалдарының ережелері</p>
<p>Дәл бір Main Power Switch дұрыс орнатылған, таңбаланған, қол жетімді және көрінеді. Тек TETRIX, REV және MATRIX - рұқсат етілген Main Power Switch болып табылады.</p>
<p>Барлық батареялар роботқа басқа роботтармен немесе ойын алаңымен тікелей байланысқа түспейтін жерлерде мықтап бекітілген.</p>
<p>Роботта дәл бір Main Battery Pack бар және Main Power Switch немесе REV Expansion Hub немесе REV Control Hub-қа дұрыс қосылған.</p>
<p>Сақтандырғыштар бар болса, оларды бастапқы орнатылғаннан жоғары немесе өндірушінің техникалық сипаттамаларына сәйкес емес сақтандырғыштармен ауыстыруға болмайды.  Сақтандырғыштар тек бір рет пайдалануға арналған.</p>
<p>Бекітілген электрондық құрылғылар RE05, RE13 және RE14-те көрсетілгеннен басқа, REV Expansion Hub немесе REV Control Hub қуат порттары арқылы қуат алады.</p>
<p>REV Expansion Hub және/немесе REV Control Hub роботтың негізгі батареясынан қуат алады.</p>
<p>REV SPARK Mini Motor Controller және REV Servo Power Module роботтың негізгі батареясынан немесе REV Control немесе Expansion Hub XT30 портынан қуат алады.</p>
<p>Рұқсат етілген сенсорлар тек REV Expansion Hub немесе REV Control Hub арқылы жұмыс істейді.</p>
<p>Жарық көздері (соның ішінде жарық диодтары (LED)) REV Robotics 2m қашықтық сенсорынан басқа жолмен бағытталмаған.  Жарық көздері рұқсат етілген әдістермен қуаттандырылады.</p>
<p>Бейне жазба құрылғылары (пайдаланылған жағдайда) кірістірілген батареядан қуат алады және олардың сымсыз байланысы өшірілген.</p>
<p>Смартфон робот контроллер Android құрылғысы (қолданылған жағдайда) кірістірілген батареядан немесе REV Expansion Hub - ның кірістірілген зарядтау функциясынан қуат алады.</p>
<p>Дәл бір робот контроллері (a) смартфон Android құрылғысы + REV Expansion Hub немесе b) REV Control Hub қажет.  Бір қосымша REV Expansion Hub рұқсат етіледі.</p>
<p>REV Expansion Hub, REV Control Hub, REV Servo Power Module, REV Spark Mini Motor Controller және VEX Motor Controller 29 ғана рұқсат етілген Motor және Servo Controllers.</p>
<p>Роботта рұқсат етілген үлгілердің саны сегіз (8) DC моторынан аспайды.</p>
<p>Роботта серво саны он екіден (12) аспайды.  Олар REV Expansion Hub, REV Control Hub, REV Servo Power Module немесе VEX Motor Controller 29-бен үйлесімді болуы және контроллерге арналған өндірушінің техникалық сипаттамаларынан аспауы керек.</p>
<p>Робот тек рұқсат етілген сенсорларды қамтиды және олар тек REV Expansion Hub немесе REV Control Hub - қа қосылған.</p>
<p>Қуат және қозғалтқышты басқару сымдары оң (қызыл, ақ, қоңыр немесе жолақты қара) және теріс / жалпы (қара немесе көк) сымдар үшін қолданылатын әртүрлі түстермен дұрыс таңбаланған.</p>
<p>Қуат, моторды басқару, серво және сенсор сымдарының өлшемдері дұрыс.</p>
<p>Егер электроника робот жақтауына негізделген болса, жалғыз мақұлданған әдіс-REV Robotics Resistive Grounding Strap. Қажет болса, REV Robotics Anderson Powerpole to xt30 адаптері Resistive Grounding Strap-қа қосыла алады. Басқа негіздейтін планкалар немесе кабельдер рұқсат етілмейді.</p>
<p>Мақұлданған электр және электронды құрылғылар оларды пайдалануға жарамды ету үшін өзгертілуі мүмкін; оларды ішкі немесе олардың қауіпсіздігіне әсер ететін кез келген жолмен өзгертуге болады.</p>
<p>Ойын алаңында дөңгелектің/протектордың зақымдануын тексеру(міндетті емес)</p>
<p>Робот ойын алаңының тақтайшасына зақым келтірмеді. [Бұл қосымша сынақ, егер инспектор трансмиссия протекторы ойын тақтайшасын зақымдауы мүмкін деп санаса ғана орындалады.]</p>
<p>Командалық ұпай элементін тексеру (TSE)</p>
<p>Командалар тексеру үшін өздерінің альянсына қатысты барлық TSE-ді ұсынуы керек. TSE-дің басым түсі команданың матчқа тағайындалған альянсына сәйкес келуі керек (қызыл немесе көк).</p>
<p>TSE 7.3.2-бөлімде көрсетілген Robot Mechanical Parts and Materials Rules талаптарын қанағаттандырады.</p>
<p>TSE максималды өлшемі-4 дюйм (10,16 см) - 4 дюйм (10,16 см) - 4 дюйм (10,16 см). TSE минималды өлшемі 3 дюйм (7,62 см) - 3 дюйм (7,62 см) - 3 дюйм (7,62 см).</p>
<p>Командалық ұпай элементі(TSE) команда нөмірімен белгіленеді (тек сандармен).</p>
<p>TSE құрамында 7.3-бөлімде көрсетілген роботты жасау ережелерін бұзатын электроника немесе басқа бөлшектер немесе материалдар жоқ.</p>
<p>TSE маусымдағы COTS ұпай санайтын кез келген элементтерін пайдаланбайды немесе оған ұқсас емес.</p>
<p>Signal Sleeve Тексеру</p>
<p>FIRST әзірлеген үлгі Signal Sleeve(S) жасау үшін пайдаланылды.</p>
<p>Signal Sleeve(s) суреттері ағымдағы маусымның турнирімен бірге келген суреттерге ұқсамайды және олар толығымен талаптарға сай келеді.</p>
<p>Signal Sleeve(s) - та белгіленген үш жерде команда нөмірі көрсетілуі керек және сандар 12 дюйм (30,48 см) қашықтықтан қараған кезде түсінікті болуы керек.</p>
<p>Signal Sleeves тек рұқсат етілген материалдардан жасалған, барлық суреттер мен командалық нөмір басылған (басып шығарғаннан кейін басқа элементтер қосылмайды) және байланыстырушы ұштар тек бау немесе желім арқылы біріктіріледі.</p>
         
        </div>
    );
}

export default InspOneComponent;
