import React from 'react';
import 'bootstrap/dist/css/bootstrap.css';
import {Link} from 'react-router-dom';


function softFiveComponent() {
    return (
        <div>
            
         
          
            <p>
Кіріспе:
</p>  
<p>
  FIRST Tech Challenge мақсаты-жастарды STEM көшбасшыларының келесі буыны болуға шабыттандыру жəне
тəлімгердің басшылығымен робототехника конкурсына қатысу арқылы инноваторлар. FIRST Tech Challange-ке қатысатын командалар əртүрлі тапсырмаларды орындайтын робот жасау керек. Тапсырмалар маусымнан маусымға жəне
əр маусымның басында жарияланатын ойын ережелерінің жиынтығына негізделген. Қаншалықты робот команда жасай алса, соншалықты ол көп ұпай жинай алады.
</p>
<p>
  Автономды жəне жүргізуші басқаратын:
</p>
<p>
  First Tech Challenge матчы автономды фазадан жəне жүргізуші басқаратын немесе теледидармен басқарылатын фазадан тұрады. Матчтың автономды кезеңінде робот адамның қатысуынсыз немесе бақылаусыз жұмыс істейді. Жүргізуші басқаратын кезеңде робот екі адам жүргізушісінен тапсырма ала алады.
</p>
<p>
  "Нүкте-нүкте"басқару жүйесі:
</p>
<p>
  The FIRST Tech Challenge роботтарын басқару үшін Android құрылғыларын пайдаланады. Жарыс кезінде əр командада екі Android device-тары болады.
</p>
<p>
Бір Android құрылғысы роботқа орнатылған жəне ол Robot Controller деп аталады. Robot Controller роботтың «миы» ретінде əрекет етеді. Ол роботтың барлық ойларын жасайды жəне роботқа не істеу керектігін айтады. Ол мынадан тұрады FTC Robot Controller қолданбасы бар Android құрылғысы. Аппараттық құралдың екі нұсқасы қазір қолданылуда: REV
</p>
<p>
Robotics Expansion Hub немесе REV Robotics Control Hub.
Екінші Android құрылғысы команда драйверлерімен бірге отырады жəне бір немесе екі геймпад қосылған. Бұл екінші құрылғы Driver Station ретінде белгілі. Driver Station қашықтан басқару құралы сияқты, роботты басқару үшін пайдалануға болады. Driver Station командаға қашықтан (қауіпсіз, сымсыз қосылымды пайдалану арқылы) байланыс орнатуға мүмкіндік береді
</p>
<p>
Робот контроллері жəне робот контроллеріне командалар беру. Driver Station Android құрылғысынан тұрады
(смартфон немесе REV Driver Hub) FTC Driver Station қолданбасын іске қосады. REV драйвер хабында FTC драйвері бар
Станция қолданбасы құрылғыда алдын ала орнатылған. 
</p>
<p>
  Ескертпе: зарядталғаннан кейін қолданбаны хабқа қайта орнатудың қажеті жоқ
Wi-Fi желісіне қосылған..
</p>
<p>
  REV Robotics кеңейту хабы:
</p>
<p>
REV Robotics Expansion Hub робот контроллеріне мүмкіндік беретін электрондық кіріс/шығыс (немесе «I/O») модулі болып табылады роботтың қозғалтқыштарымен, серволарымен жəне сенсорларымен қосылады. Робот контроллері кеңейту хабымен байланысады сериялық қосылым арқылы. Android смартфоны Robot Controller ретінде пайдаланылатын жағдайда сериялық қосылымды орнату үшін USB кабелі қолданылады. REV Robotics Control Hub пайдаланылған жағдайда,
кірістірілген Android құрылғысы мен кеңейту хабы арасында ішкі сериялық байланыс бар.
</p>
<p>
  Expansion Hub 12 вольттық батареяға қосылған, сонымен сервер, моторларды, қуаттандырады.
</p>
<p>
  Егер Android смартфоны робот контроллері ретінде пайдаланылса, смартфонда өзінің тəуелсіз батареясы болады. REV Robotics Control Hub робот контроллері ретінде пайдаланылса, басқару хабы ішкі Android құрылғысын қуаттандыру үшін негізгі 12 В батареяны пайдаланады.
</p>
<p>
  REV Robotics Control Hub:
</p>
<p>
  Controll Hub-та робот контроллерінің біріктірілген нұсқасы бар. Ол ішіне орнатылған Android құрылғысын біріктіреді
REV Robotics Expansion Hub сияқты корпус.
</p>
<p>
  Controll hub, оның кірістірілген Android құрылғысы ішкі арқылы кеңейту хабына тікелей қосылған
сериялық автобус Android робот контроллері мен енгізу/шығару арасындағы сыртқы USB қосылымының қажеттілігін болдырмайтын I/O модуль
</p>
<p>
  Операциялық режим дегеніміз не?:
</p>
  Əдеттегі FIRST Tech Challenge матчында команданың роботы əртүрлі тапсырмаларды орындауда ұпай жинайды. Мысалы, команда өз роботының жарыс алаңындағы ақ сызықты, содан кейін жүруін қалауы мүмкін матч кезінде ойын элементін (мысалы, допты) өз бетінше қақпаға соғады. Командалар «іс режимдерін» жазады (ол роботының əрекетін көрсету үшін «жұмыс режимдерін» білдіреді).
  <p>
Операциялық режимдер – бəсекелес роботтың əрекетін реттеу үшін пайдаланылатын компьютерлік бағдарламалар. Робот Контроллер сəйкестік кезінде белгілі бір тапсырмаларды орындау үшін таңдалған жұмыс режимін орындай алады.
</p>
<p>
FIRST Tech Challenge-ге қатысатын командаларда олар пайдалана алатын түрлі бағдарламалау құралдары бар.
өздерінің жұмыс режимдерін жасау. Командалар FTC блоктары деп аталатын көрнекі («сүйреп апару») бағдарламалау құралын пайдалана алады
    </p>
  <p>
Олардың жұмыс режимдерін жасау үшін бағдарламалау құралы. Командалар FTC OnBot деп аталатын мəтіндік Java құралын да пайдалана алады Java бағдарламалау құралы немесе Google компаниясының Android Studio біріктірілген əзірлеу ортасы (сонымен бірге «IDE») олардың жұмыс режимдерін жасау үшін.
</p>
  <p>
    Қажетті материалдар тізімі:
  </p>
<p>
  Бұл нұсқаулықта FTC басқару жүйесін конфигурациялау, бағдарламалау жəне пайдалану жолын көрсететін оқулықтар бар.
</p>
  <p>
    Оқулықтарды аяқтау үшін сізде келесі материалдар болуы керек:
  </p>
  <p>
  Екі (2) FIRST мақұлдаған* Android
  құрылғылар (Robot Controller смартфоны
жəне Driver Station смартфоны немесе
Driver Hub).
Немесе...
Бір (1) Controll хабы жəне бір (1) FIRST мақұлдаған* Android смартфоны.
  </p>
  <p>
    Microsoft Windows 7, 8 немесе
10 жəне Wi-Fi мүмкіндігі.
Ескерту: ноутбукта ең ағымдағы қызмет пакеттері мен жүйесі Microsoft жаңартулары болуы керек.

 Басқа түрін пайдалансаңыз
құрылғы (мысалы, Chromebook,
Android планшеті жəне т.б.) сіздің ретінде бағдарламалау құрылғысы, қадамдар болуы мүмкін қол жеткізу жолында аздап ерекшеленеді
Javascript қосылған веб-шолғыш (Google Chrome — ұсынылатын шолғыш).
   </p>
  <p>
    Егер сіз смартфонды Робот контроллері ретінде пайдалансаңыз, сізге REV Robotics Expansion hub (REV-31-
1153) қозғалтқыштарға, серволарға,
жəне сенсорларға қосылу үшін қажет. Control Hub пайдаланушылары Expansion hub-ті қосу арқылы пайдаланады.
REV Robotics қосқышы, кабель жəне кронштейн (REV-31-1387).
  </p>
  <p>
    Мақұлданған 12 В батареяны пайдалансаңыз оның Tamiya қосқышы бар (мысалы
Tetrix W39057 батареясы) сізге қажет болады REV Robotics Tamiya - XT30 адаптері Кабель (REV-31-1382).
Егер сізде REV Robotics Slim батареясы болса (REV-31-1302) онда сізге қажет болмайды
бұл адаптер REV батареясынан бері
XT30 қосқышы əлдеқашан бар.
  </p>




  <p>
          10. Wi-Fi таңдаңыз, содан кейін дұрыс желіні таңдаңыз
Егер сіз бірінші рет Control Hub-қа қосылып жатсаңыз, содан кейін əдепкі желіге аты «FTC-» префиксімен басталуы керек (осы мысалдағы «FTC-1Ybr»).
Əдепкі желі атауы тізімінде болуы керек төменгі жағына бекітілген жапсырма басқару хабы.
        </p>
        <p>
          11. Сұралған кезде құпия сөзді көрсетіңіз Control Hub WiFi желісін таңдап,түймесін басыңыз. Сондай-ақ, Control Hub WiFi желісіне сəтті қосылғанын ескеріңіз.
        </p>
        <p>
          12. Driver Station экранында бар екенін тексеріңіз өзгерді жəне ол қазір солай екенін көрсетеді басқару хабына қосылған. Control Hub WiFi желісінің атауы («Осы мысалдағы FTC-1Ybr») драйвердегі желі өрісінде көрсетілу керек.
        </p>
        <p>
          Екі Android смартфоны бар пайдаланушылар
Маңызды ескерту: Driver Station бұрын Control Hub-пен жұптастырылған болса жəне сіз қазір жұптасаңыз Robot Controller Android смартфонына қосылғыңыз келеді, содан кейін роботпен жұптастыру əрекетінен бұрын Контроллер, алдыңғы Control Hub үшін Wi-Fi желісін ұмыту керек (Android Wifi арқылы
Driver Station телефонындағы параметрлер экраны), содан кейін Driver Station телефонын қуаттандыруды қосыңыз. Алдыңғы Control Hub қосулы жəне бұл желіні ұмытпаған болсаңыз, Driver Station əрекет етуі мүмкін жəне Control Hub-на қосылыңыз жəне Robot Controller смартфонына қосыла алмауыңыз мүмкін. FTC қолданбаларын Android телефондарына сəтті орнатқаннан кейін, сіз мынаны орнатқыңыз келеді екі құрылғы арасындағы қауіпсіз сымсыз байланыс. Бұл қосылым Driver Station телефоныңызға жұмыс режимдерін Robot Controller-ден таңдауға мүмкіндік береді, осы бағдарламаларға геймпад кірісін жіберіңіз. Сол сияқты болады Робот контроллері телефонында жұмыс істейтін жұмыс режимдеріне драйвер станциясына телеметрия деректерін жіберуге мүмкіндік беріңіз драйверлеріңіз үшін көрсетілетін телефон. Екі телефонды қосу процесі «жұптастыру» деп аталады.
        </p>
        <p>
          Құрылғыларды Control немесе Expansion хабына қосу:
        </p>
        <p>
Бұл бөлім REV Robotics Control Hub жүйесіне қозғалтқышты, сервоны жəне кейбір сенсорларды қосу жолын түсіндіреді.
немесе REV Robotics Expansion Hub. Басқару хабы кіріктірілген болғандықтан кеңейту хабынан ерекшеленеді
Android құрылғысы, сыртқы қозғалтқыштың орналасуы, серво жəне сенсор порттары Басқару хабы үшін бірдей жəне
Кеңейту хабы.
Бұл бөлімдегі кескіндер құрылғыларды қосу жолын көрсету үшін кеңейту хабын пайдаланады. Процесс,
дегенмен, басқару хабы үшін бірдей.
Осы бөлімдегі нұсқаулар «Хаб» сөзін пайдаланған кезде, олар басқару концентраторына немесе кеңейту хабына сілтеме жасайды.
        </p>
        <p>
          Хабқа 12 В қуат қосу:
        </p>
        <p>
          Хаб 12 В қайта зарядталатын батареядан қуат алады. Қауіпсіздік мақсатында аккумуляторда 20А сақтандырғыш орнатылған.
Қуатты қосу/өшіру үшін механикалық қосқыш қолданылады.
Бұл тапсырманы орындау үшін шамамен 5 минут қажет екенін ескеріңіз.
        </p>
        <p>
          1. 12 В батареяңызда Tamiya стиліндегі қосқыш болса, Tamiya - XT30 адаптер кабелін желіге қосыңыз.
Маңызды ескерту: 12 В батареяны Tamiya адаптеріне əлі қоспаңыз. Біз батареяны кейінгі қадам кезінде қосамыз.
        </p>
<p>
          2. Коммутатор кабелінің екінші ұшын хабтағы сəйкес XT30 портына жалғаңыз.
        </p>
        <p>
          3. Коммутатордың ӨШІРУЛІ күйінде екенін тексеріңіз.
        </p>
        <p>
          4. 12 В батареяны Tamiya - XT30 кабеліне жалғаңыз.
        </p>
        <p>
          5. Коммутаторды қосыңыз жəне хаб батареядан қуат алатынын тексеріңіз. Хабтың жарық диоды екенін ескеріңіз
жарықтандырылуы керек (төмендегі суреттегі хабтың жоғарғы оң жақ бұрышындағы көк LED-ке назар аударыңыз).
        </p>
        <p>
          6. Коммутаторды өшіріп, хабтың өшірулі екенін тексеріңіз. Хабтың жарық диоды жанбауы керек екенін ескеріңіз.
        </p>
        
        
        </div>

    );
}

export default softFiveComponent;
