import React from 'react';
import 'bootstrap/dist/css/bootstrap.css';
import './index.css'




function DocFiveComponent() {
    return (
        <div>
          <h3>Өзін-өзі бағалауға арналған инженерлік дәптер</h3>
          <p>Блокнот форматы</p>
          <p>Қажет: кем дегенде бір дәптер, екіден көп емес. Төрелер 2 дәптерден артық қарамайды.</p>
          <p>Қажет: сыртындағы команда нөмірі. Төрелер дәптердің кімге тиесілі екенін білуі керек.</p>
          <p>Ұсынылады: қысқаша мазмұны бар бет - сыртына немесе блокноттың алғашқы 3 бетіне бекітілген.</p>
          <p>Команда нөмірі. Егер сіздің мазмұн парағыңыз дәптерден түсіп кетсе, төрелер оның кімге тиесілі екенін біледі.</p>
          <p>Команда, мектеп/ұйым туралы қысқаша баяндау және бір бетте маусымда болған команданың маңызды сәттеріне шолу.</p>
          <p>Төрелерге арнап бетті нөмірлереп немесе беттеріне белгі қойып команда төрешілер қарастырғысы келетін блокноттағы беттерге сілтемелер жасай алады. Бұл төрілерді сіз көргіңіз келетін нәрсеге бағыттаудың оңай жолы!</p>
          <p>Ұсынылады: Блокнот бөлімдерге бөлінеді, соның ішінде:</p>
          <p>Жобалау процесін сипаттайтын бөлім</p>
          <p>Команданы, ақпараттық-насихаттық іс-шараларды және жеке мақсаттарды сипаттайтын бөлім</p>
          <p>Командалық жоспар</p>
          <p>Блокнот бөлімдері</p>
          <p>Инженерлік мазмұн:</p>
          <p>Роботты жобалау, құрастыру және сынау кезеңдерін сипаттайтын инженерлік мазмұн</p>
          <p>Кодты әзірлеу процесін қамтиды. Кодтың өзін қосудың қажеті жоқ.</p>
          <p>Команда туралы ақпарат</p>
          <p>Команда мүшелерінің менторы мен тренерінің өмірбаяны. Фамилияларды мүмкіндігінше қолданбаңыз.</p>
          <p>Команда демеушісі(спонсоры) туралы ақпарат</p>
          <p>Команданың ақпараттық-насихаттық іс-шаралары, соның ішінде қаражат жинау, демонстрациялар, әртүрлі қауымдастықтармен байланыс және т. б.</p>
          <p>Команда жоспары мыналарды қамтуы мүмкін.</p>
          <p>Бизнес-жоспар:</p>
          <p>Мақсат қою</p>
          <p>Команданы қаржыландыру / бюджеттеу</p>
          <p>Стратегиялық жоспар</p>
          <p>Мақсатқа қалай жетуге болады</p>
          <p>Тұрақты даму жоспары</p>
          <p>Сіздің командаңыз 1 жылдан кейін, 2 жылдан кейін және т. б. қайда болады деп үміттенесіз? Сіз оған қалай жетесіз?</p>
          <p>Блокнот бойынша ұсыныстар-мазмұны мен сапасы</p>
          <p>Форматы бойынша ұсыныстар</p>
          <p>Шығармашылық сыртқы бет, команданың фотосуреті және т. б.</p>
          <p>Мазмұны және бөлгіштер</p>
          <p>Ұқыпты ұйымдастыру, ақпаратты ұқыпты ұсыну</p>
          <p>Маңызды беттердегі белгілер қойыңыз немесе түйіндемеңізде оларды көрсету үшін оларды нөмірлеңіз.</p>
          <p>Парақтың екі жағында жасалған жазбалар</p>
          <p>Мазмұны бойынша ұсыныстар</p>
          <p>Команданың өсуі мен дамуы құжатталған</p>
          <p>Команданың көшбасшылығы мен ұйымы құжатталған</p>
          <p>Команданың сәтсіздіктері мен күрестері құжатталған</p>
          <p>Команданың әрбір мүшесі дәптерге өз үлесін қосады</p>
          <p>Әр кездесу жайлы блокнотта кем дегенде бір жазба бар</p>
          <p>Жазбаларға суреттер, сызбалар және қажет болған жағдайда мәтін кіреді</p>
          <p>Дәптер-бұл команда мен оның саяхаты туралы нақты түсінік</p>
          <p>Блокнот Робот жоспарындағы өзгерістерді, соның ішінде өзгерістердің себебін құжаттайды</p>
        </div>
    );
}

export default DocFiveComponent;
