import React from 'react';
import 'bootstrap/dist/css/bootstrap.css';
import './index.css'




function DocEightComponent() {
    return (
        <div>
          <h3>Инженерный блокнот для самооценки</h3>
          <p>Форматирование блокнота</p>
          <p>Требуется: Минимум один блокнот, не более двух. Судьи не будут просматривать более 2 блокнотов.</p>
          <p>Требуется: Номер команды на внешней стороне обложки. Судьи должны знать, кому принадлежит блокнот.</p>
          <p>Рекомендуется: Страница с кратким изложением - либо прикрепленная к обложке, либо на первых 3 страницах блокнота.</p>
          <p>Номер команды. Если страница вашего изложения выпадет из блокнота, судьи узнают, кому она принадлежит.</p>
          <p>Краткое повествование о команде, школе/организации и обзор основных моментов сезона команды на одной странице.</p>
          <p>Ссылки на номера страниц или страницы с вкладками для судей на страницы в блокноте, которые команда хотела бы, чтобы судьи рассмотрели. Это простой способ направить судей на то, что вы хотите, чтобы они увидели!</p>
          <p>Рекомендуется: Блокнот разделен на разделы, включая:</p>
          <p>Раздел, описывающий процесс проектирования</p>
          <p>Раздел, в котором описывается команда, информационно-поощряющие мероприятия и индивидуальные цели</p>
          <p>Командный план</p>
          <p>Разделы блокнота</p>
          <p>Инженерный контент:</p>
          <p>Инженерный контент, описывающий этапы проектирования, сборки и тестирования робота</p>
          <p>Включает в себя процесс разработки кода. Вам не нужно добавлять сам код.</p>
          <p>Информация о команде</p>
          <p>Биографии тренера и наставника членов команды. Пожалуйста, не используйте фамилии.</p>
          <p>Информация о спонсоре команды</p>
          <p>Информационно-поощряющие мероприятия команды, включая сбор средств, демонстрации, связи с разными сообществами и т.д.</p>
          <p>План команды может включать следующее.</p>
          <p>Бизнес-план:</p>
          <p>Постановка цели</p>
          <p>Финансирование команды/Составление бюджета</p>
          <p>Стратегический план</p>
          <p>Как достичь цели</p>
          <p>План устойчивого развития</p>
          <p>Где ваша команда надеется быть через 1 год, 2 года и т.д.? Как вы туда доберетесь?</p>
          <p>Предложения по блокноту– Содержание и качество</p>
          <p>Предложения по форматированию</p>
          <p>Креативная обложка, фотография команды и т.д.</p>
          <p>Оглавление и разделители</p>
          <p>Аккуратная организация, аккуратное представление информации</p>
          <p>Вкладки на важных страницах или пронумеровать их, чтобы в вашем резюме можно было указать на них.</p>
          <p>Записи, сделанные на обеих сторонах листа</p>
          <p>Предложения по содержанию</p>
          <p>Рост и развитие команды задокументированы</p>
          <p>Лидерство и организация команды задокументированы</p>
          <p>Неудачи и борьба команды задокументированы</p>
          <p>Каждый член команды вносит свой вклад в блокнот</p>
          <p>У каждой встречи есть по крайней мере одна запись в блокноте</p>
          <p>Записи включают изображения, чертежи и текст, если это применимо</p>
          <p>Блокнот - это точное представление о команде и его путешествии</p>
          <p>Блокнот документирует изменения в плане робота, включая причину внесения изменений</p>
        </div>
    );
}

export default DocEightComponent;
