import React from 'react';
import 'bootstrap/dist/css/bootstrap.css';
import './index.css'




function KazFourComponent() {
    return (
        <div>
          <p>Трансмиссия (база для робота)</p>
          <p>Препятствия и задачи на поле</p>
          <p>Сетка переходов на поле POWERPLAY - самое большое полевое препятствие в этом сезоне. Наземные, низкие, средние и высокие переходы, расположенные на расстоянии 2 футов друг от друга, могут ограничить пространство, необходимое вашему роботу для перемещения по полю. Существуют также препятствия на полу - наземные переходы. Стыки с грунтом имеют высоту 0,56 дюйма и углубление, на котором могут застрять трансмиссии, если у них нет требуемого зазора. Однако, как только на наземном перекрестке будет образован конус, вы больше не сможете проезжать по этому перекрестку.</p>
          <p>Ограничения по размеру робота</p>
          <p>Правила роботов в основном остались прежними для игры этого года. Основным ограничением является начальное требование к размеру 18 "x 18" x 18"</p>
          <p>Варианты трансмиссии</p>
          <p>Несмотря на то, что существует множество типов трансмиссий, которые могут создавать команды, приоритетом должно быть как можно более быстрое введение трансмиссии в эксплуатацию для начала тестирования. В этом году двумя основными трансмиссиями, которые мы рассматривали, были дифференциальный привод и механический привод</p>
          <p>Дифференциальная трансмиссия</p>
          <p>Использование дифференциала или танковой трансмиссии, такой как наша канальная трансмиссия, является надежным вариантом для команд.</p>
          <p>Трансмиссия Mecanum</p>
          <p>Использование трансмиссии Mecanum придает командам дополнительную маневренность на поле, позволяя шасси перемещаться во всех направлениях.</p>
          <p>Другие варианты</p>
          <p>В дополнение к замене колес, вы можете изменять другие части вашей трансмиссии, чтобы повысить эффективность ее использования в условиях POWERPLAY. Один из способов сделать это - изменить размер вашего фрейма. Если вы уменьшите размер своей трансмиссии, у вас будет больше места для передвижения по сетке, чем если бы вы построили своего робота с полными размерами 18 X 18 дюймов. Однако, если вы сделаете это, обратите внимание на геометрию других ваших механизмов, поскольку она тоже изменится. Также рассмотрите возможность увеличения мощности вашей трансмиссии с помощью подушечных блоков, если вам требуется больший зазор для преодоления препятствий. Это похоже на то, что мы сделали с ботом Freight Frenzy Starter.</p>
          <p>Обновление трансмиссии Starter Bot</p>
          <p>Использование дифференциала, mecanum или другой трансмиссии для робота приведет команду к успеху в этом сезоне. Для нашего прототипирования и окончательного стартера, но при канальной трансмиссии. В видео ниже мы установили дополнительное обновление mecanum для нашего стартера, но для того, чтобы подчеркнуть его маневренность на поле этого года.аналогично тому, что мы сделали со стартовым ботом Freight Frenzy.</p>

          
         
        </div>
    );
}

export default KazFourComponent;
