import React from 'react';
import 'bootstrap/dist/css/bootstrap.css';
import './index.css'




function InspThreeComponent() {
    return (
        <div>
        
        <p>
  Если электроника заземлена на раму робота, единственным одобренным методом является REV Robotics Resistive Grounding Strap. При необходимости адаптер REV Robotics Anderson Powerpole to XT30 может подключаться к Resistive Grounding Strap. Никакие другие заземляющие планки или кабели не допускаются.
</p>
<p>
  Одобренные электрические и электронные устройства могут быть изменены, чтобы сделать их более пригодными для использования; они не могут быть изменены внутренне или каким-либо образом, влияющим на их безопасность.
</p>
<p>
  Проверка повреждений колеса/протектора на игровом поле - необязательно
</p>
<p>
  Робот не повредил плитку игрового поля. [Это необязательный тест, который выполняется только в том случае, если инспектор считает, что протектор трансмиссии может повредить плитку игрового поля.]
</p>
<p>
  Проверка элемента подсчета очков в команде (TSE)
</p>
<p>
  Команды должны представить все TSE, относящиеся к их Альянсу, для проверки. Преобладающий цвет TSE должен соответствовать назначенному альянсу команды на матч (красный или синий).
</p>
<p>
  TSE удовлетворяет требования к Robot Mechanical Parts and Materials Rules, изложенным в разделе 7.3.2.
</p>
<p>
  Максимальный размер TSE составляет 4 дюйма (10,16 см) на 4 дюйма (10,16 см) на 4 дюйма (10,16 см). Минимальный размер TSE составляет 3 дюйма (7,62 см) на 3 дюйма (7,62 см) на 3 дюйма (7,62 см).
</p>
<p>
  Элемент подсчета очков команды(TSE) помечен номером команды (только цифрами).
</p>
<p>
  TSE не содержит электроники или каких-либо других деталей или материалов, которые нарушают правила конструирования робота, изложенные в разделе 7.3.
</p>
<p>
  TSE не использует и не напоминает какие-либо элементы подсчета очков COTS текущего сезона.
</p>
<p>
  Проверка Signal Sleeve
</p>
<p>
  Шаблон разработанный FIRST был использован для создания Signal Sleeve(s).
</p>
<p>
  Изображения на Signal Sleeve(s) не похожи на изображения, прилагаемые к турниру текущего сезона, и они полностью находятся в пределах отведенных зон.
</p>
<p>
  На Signal Sleeve(s) должен быть указан номер команды в трех обозначенных местах, и числа должны быть разборчивыми при просмотре с расстояния 12 дюймов (30,48 см).
</p>
<p>
  Signal Sleeves изготавливаются только из разрешенных материалов, все изображения и номер команды напечатаны (после печати никаких дополнительных элементы не добавлены), а соединительные концы соединяются вместе только с помощью ленты или клея.
</p>

         
        </div>
    );
}

export default InspThreeComponent;
