import React from 'react';
import 'bootstrap/dist/css/bootstrap.css';


function wardThreeComponent() {
    return (
        <div>
            <h3>Описание наград</h3>
            <p> Inspire award
 Эта награда присуждается команде, которая лучше всего воплощает в себе «вызов» программы FIRST Tech Challenge.  Команда, получившая эту награду, является сильным представителем программ FIRST и образцом для подражания.  Эта команда является главным претендентом на множество других судейских наград и достойным соперником.
 Победитель Inspire Award вдохновляет другие команды, действуя с Благородным Профессионализмом® как на игровом поле, так и за его пределами.  Эта команда делится своим опытом, энтузиазмом и знаниями с другими командами, спонсорами, своим сообществом и судьями.  Работая как единое целое, эта команда продемонстрирует успех в выполнении задачи по проектированию и созданию робота.
 Обязательные критерии для получения награды Inspire:
 Команда должна проявлять уважение и благородный профессионализм® ко всем, кого они встречают на мероприятии FIRST Tech Challenge.
 Команда должна быть сильным претендентом на несколько других судейских наград.  Награда Inspire отмечает самые сильные качества всех присужденных наград.
 Должен быть претендентом на Machine, Creativity, and Innovation Award.
 Должен быть претендентом на награду Team Attributes Award.
 Должен быть претендентом на премию Think Award.
 Команда должна быть представителем программ FIRST.  Они демонстрируют и документируют свою работу в своем сообществе.
 Команда должна быть позитивной и всесторонней, и каждый член команды должен вносить свой вклад в успех команды.
 Команда должна представить инженерное портфолио.  Инженерное портфолио должно включать инженерное содержание, информацию о команде и план команды. 
</p>
<p>Все инженерное портфолио должно быть качественным, продуманным, тщательным, кратким и хорошо организованным.
 Дизайн робота должен быть креативным и инновационным, а робот должен надежно работать на поле.  Команда четко сообщает судьям о конструкции и стратегии своего робота.
 Сессия группового интервью должна быть профессиональной и увлекательной.
 Настоятельно рекомендуемые критерии для Inspire award:
 Команда должна иметь возможность поделиться или предоставить более подробную информацию для поддержки информации в портфолио.
 Команда должна обратиться к Award Definitions Appendix F Game Manual Part 1, чтобы информировать и быть в состоянии предоставить подтверждающую документацию судьям, где это применимо.
</p>
<p>Think award
 Решение инженерных проблем с помощью творческого мышления.
 Эта награда присуждается команде, которая лучше всего отразит путь, пройденный командой во время процесса инженерного проектирования в течение сезона.  Инженерное содержание портфолио является ключевым Revision 1: 10/10/2022 Page |  2 ссылки для судей, чтобы помочь определить самую достойную команду.  Инженерный контент команды должен быть сосредоточен на этапах проектирования и сборки робота команды.
 Команда должна иметь возможность поделиться или предоставить дополнительную подробную информацию, которая будет полезна судьям.  Сюда могут входить описания научных и математических принципов проектирования роботов и игровых стратегий, дизайнов, модификаций, успехов и возможностей для улучшения.  Команда не является кандидатом на эту награду, если в ее портфолио нет инженерного контента.
 Обязательные критерии для Think Award:
 Команда должна проявлять уважение и благородный профессионализм® ко всем, кого они встречают на мероприятии FIRST Tech Challenge.
 Команда должна представить инженерное портфолио.
 Инженерное портфолио должно иметь инженерное содержание.  Инженерное содержание может включать записи, описывающие примеры лежащих в основе науки, математики и игровых стратегий в краткой форме.
 Инженерное портфолио должно содержать примеры, которые показывают, что команда имеет четкое представление о процессе инженерного проектирования, включая примеры извлеченных уроков.
</p>
<p> Настоятельно рекомендуемые критерии для премии Think Award:
 Команда должна быть в состоянии описать или предоставить судьям дополнительную информацию о содержании своего портфолио.
 Инженерное портфолио может резюмировать, как команда приобрела новых наставников или приобрела новые знания и опыт от своих наставников.
 Инженерное портфолио может содержать краткое изложение общего плана команды.
 Инженерное портфолио может содержать информацию о планах развития навыков членов команды.
 Формат портфолио менее важен, но позволяет судьям понять зрелость дизайна команды, организационные возможности и общую структуру команды.
 В портфолио можно ссылаться на конкретный опыт и извлеченные уроки, но оно должно отражать краткую информацию о статусе команды и дизайне их роботов.
 Портфолио также может обобщать опыт и уроки, извлеченные из информационно-продвигающих активностей, с краткими таблицами результатов.
 Команда должна обратиться к Award Definitions Appendix F Game Manual Part 1, чтобы информировать и быть в состоянии предоставить подтверждающую документацию судьям, где это применимо.
</p>
<p>Connect Award
Связь между сообществом, FIRST, и инженерным миром.
Эта награда присуждается команде, которая больше всего связана с местным сообществом в области науки, технологий, инженерии и математики (STEM). Настоящая команда FIRST - это нечто большее, чем сумма ее частей, и она признает, что привлечение местного сообщества STEM играет важную роль в их успехе. Команда получившая эту награду признана за то, что помогла разным сообществам понять FIRST, FIRST Tech Challenge и саму команду.
Команда, получившая награду Connect Award, активно ищет и привлекает инженеров и исследует возможности, доступные в мире инженерии, науки и технологий. У этой команды есть четкий командный план и определены шаги для достижения своих целей.
Необходимые критерии для получения Connect Award:
Команда должна проявлять уважение и благородный профессионализм® ко всем, с кем они встречаются на мероприятии FIRST Tech Challenge.
Команда должна представить инженерное портфолио.
Портфолио должно включать командный план, который охватывает цели команды по развитию навыков членов команды, а также шаги, которые команда предприняла или предпримет для достижения этих целей.
Примерами того, что мог бы включать план, являются:
Временные рамки
Охват научных, инженерных и математических сообществпремии
Учебные курсы.
</p>
<p>Портфолио должно включать краткое описание того, как команда приобрела новых наставников или приобрела новые знания и опыт у наставника. Работа с наставниками с сайта подбора наставников FIRST - приемлемый способ учиться у наставников.
Настоятельно рекомендуемые критерии для Connect Award:
Команда предоставляет наглядные примеры развития личных или виртуальных связей с представителями инженерного, научного или технологического сообщества.
Команда активно взаимодействует с инженерным сообществом, чтобы помочь им сначала разобраться в FIRST Tech Challenge и в самой команде.
Команда должна обратиться к Award Definitions Appendix F Game Manual Part 1, чтобы информировать и быть в состоянии предоставить подтверждающую документацию судьям, где это применимо.

</p>
<p>Innovate Award, спонсируемая Raytheon Technologies
Воплощение замечательных идей из концепции в реальность.
Innovate Award присуждается команде, которая мыслит творчески и обладает изобретательностью, креативностью и находчивостью в воплощении своих проектов в жизнь. Эта награда присуждается команде, у которой есть инновационное и креативное дизайнерское решение для любых конкретных компонентов робота в FIRST Tech Challenge. Элементы этой награды включают элегантный дизайн, надежность и нестандартное мышление, связанное с дизайном. Эта награда может касаться дизайна всего робота или определенной части робота. Креативный компонент должен работать всегда, но роботу не обязательно работать все время во время матчей, чтобы претендовать на эту награду. Инженерное портфолио команды должно включать краткое описание конструкции компонента или компонентов и робота команды, чтобы иметь право на получение этой награды. Записи должны описывать, как команда пришла к своему решению.
</p>
<p>Необходимые критерии для получения Innovate Award, спонсируемой Raytheon Technologies:
Команда должна проявлять уважение и благородный профессионализм® ко всем, с кем они встречаются на мероприятии FIRST Tech Challenge.
Команда должна представить инженерное портфолио.
Инженерное портфолио должно включать примеры инженерного контента команды, которые иллюстрируют, как команда пришла к своему решению.
Робот или его составная часть должны быть креативными, элегантными и уникальными по своей конструкции.
Творческий компонент должен быть стабильным, надежным и безотказно работать большую часть времени.
Настоятельно рекомендуемые критерии для присуждения Innovate Award, спонсируемой Raytheon Technologies:
Портфолио могло бы подтолкнуть судей расспросить команду о конкретной подробной технической информации.
Control Award, спонсируемая Arm:
Умение управлять роботом.
Control Award присуждается команде, которая использует сенсоры и программное обеспечение для повышения функциональности робота на поле. Эта награда присуждается команде, которая демонстрирует инновационное мышление для решения игровых задач, таких как автономная работа, совершенствование механических систем с интеллектуальным управлением или использование сенсоров для достижения лучших результатов. Компонент управления должен стабильно работать на поле. Инженерное портфолио команды должно содержать краткое описание программного обеспечения, сенсоров и механического управления, но не должно включать копии самого кода.
</p>
<p>Требуемые критерии для Control Award, спонсируемой Arm:
Команда должна проявлять уважение и благородный профессионализм® ко всем, с кем они встречаются на мероприятии FIRST Tech Challenge.
Команда должна подать заявку на Control Award, заполнив форму подачи заявки на Control Award, которая есть в Appendix E of Game Manual Part 2.
Форма подачи заявки на получение Control Award не должна превышать 2 страниц.
Команда должна представить инженерное портфолио. Инженерное портфолио должно включать инженерный контент, документирующий компоненты управления.
Компоненты управления должны повышать функциональность робота на игровом поле.
Настоятельно рекомендуемые критерии для присуждения Control Award, спонсируемой Arm:
Продвинутые программные техники и алгоритмы поощряются, но не обязательны.
Компоненты управления должны работать надежно.
Информация о том, что команда пробовала и что не сработало в отношении сенсоров, аппаратного обеспечения(hardware), алгоритмов и кода, могут быть включены в инженерное портфолио.
Motivate Award
Побуждать других подключиться к культуре FIRST!
Эта команда придерживается культуры FIRST и четко показывает, что значит быть командой. Эта награда присуждается команде, которая представляет суть конкурса FIRST Tech Challenge благодаря благородному профессионализму® и общему энтузиазму по поводу общей философии FIRST и того, что значит быть командой FIRST Tech Challenge. Это команда, которая прилагает коллективные усилия, чтобы сделать FIRST известным во всей своей школе и местном сообществе, и побуждает других принять культуру FIRST.
</p>
<p>Необходимые критерии для присуждения Motivate Award:
Команда должна проявлять уважение и благородный профессионализм® ко всем, с кем они встречаются на мероприятии FIRST Tech Challenge.
Команда должна представить инженерное портфолио. Инженерное портфолио должно включать план организации команды, в котором могли бы быть описаны их будущие цели и шаги, которые они предпримут для достижения этих целей.
Примерами того, что мог бы включать план, являются:
Индивидуальность команды
Цели по сбору средств
Цели в области устойчивого развития
Временные рамки
Продвижение
Финансы
Цели на общественные работы.
Команда должна быть представителем программ FIRST.
Команда должна быть в состоянии объяснить индивидуальный вклад каждого члена команды и то, как это относится к общему успеху команды.
Настоятельно рекомендуемые критерии для присуждения Motivate Award:
Команда принимает участие в их презентации и активно взаимодействует с судьями.
Команда демонстрирует творческий подход к материалам, которые продвигает их команда и FIRST.
Команда может наглядно продемонстрировать успешный набор людей, которые еще не были активны в сообществе STEM.
Команда могла бы также обобщить опыт и уроки, извлеченные в ходе информационно-продвигающей работы.
Команда должна обратиться к Award Definitions Appendix F Game Manual Part 1, чтобы информировать и быть в состоянии предоставить подтверждающую документацию судьям, где это применимо.
</p>
<p>Design Award
Технический дизайн в лучшем виде
Эта награда присуждается за элементы дизайна робота, которые являются одновременно функциональными и эстетичными. Design Award присуждается командам, которые включают элементы технического дизайна в свое решение. Эти элементы дизайна могли бы упростить внешний вид робота, придав ему чистый вид, носить декоративный характер или иным образом выражать творческий потенциал команды. Робот должен быть долговечным, эффективно спроектированным и эффективно справляться с игровыми задачами.
Требуемые критерии для присуждения Design Award:
Команда должна проявлять уважение и благородный профессионализм® ко всем, с кем они встречаются на мероприятии FIRST Tech Challenge.
Команда должна представить инженерное портфолио с инженерным контентом. Это могут быть изображения CAD или чертежи робота, общего дизайна команды и/или его компонентов.
</p>
<p>Команда должна документировать и внедрять строгие принципы технического дизайна, балансируя между формой, функциональностью и эстетикой.
Настоятельно рекомендуемые критерии для присуждения Design Award:
Отличается от других своим эстетичным и функциональным дизайном
Основа для дизайна хорошо продумана (то есть вдохновение, функциональность и т.д.).
Дизайн эффективен и согласуется с планом и стратегией команды.
Портфолио могло бы вдохновить судей расспросить команду о конкретной подробной технической информации.
Promote Award(необязательно)
Эта награда является необязательной и может присуждаться не на всех турнирах. Promote Award присуждается команде, которая наиболее успешно создала убедительное видеообращение для общественности, призванное изменить нашу культуру и прославить науку, технологии, инженерное дело и математику. Команды должны представить одноминутное видео с объявлением о проведении публичных мероприятий (PSA - Public Service Announcement), основанное на теме PSA на сезон. Команда может выиграть награду Promote Award только один раз на турнире уровня чемпионата и только один раз на отборочном турнире или турнире уровня лиги.
Тема PSA на сезон 2022-2023: “Как я узнал(a) о FIRST”
Необходимые критерии для Promote Award:
Видео должно соответствовать стандартам брендинга FIRST и дизайна.
Продолжительность видео не может превышать 60 секунд.
Видео должно быть высокого качества, так как материалы могут быть использованы позже для продвижения FIRST.
Команда должна иметь права на музыку, использованную в видео.
Музыка и разрешения должны быть указаны в титрах видео.
Видео должно иметь высокую производственную ценность.
Видео должно быть отправлено до дедлайна, указанного директором турнира.
Команда должна представить продуманное и впечатляющее видео, которое понравится публике.
Требуется творческий подход к интерпретации ежегодной темы.
Следуйте рекомендациям по заявке видео.
Compass Award (необязательно)
Маяк и лидер на пути к FIRST Tech Challenge.
</p>
<p>Эта награда является необязательной и может присуждаться не на всех турнирах. Compass Award присуждается взрослому тренеру или наставнику, который в течение года оказывал выдающееся руководство и поддержку команде и демонстрировал команде, что значит благородный профессионализм. Победитель Compass Award будет выбран из кандидатов, выдвинутых членами студенческой команды FIRST Tech Challenge, с помощью 40-60-секундного видеоролика. В видео должно быть рассказано о том, как их наставник помог им стать вдохновляющей командой. Мы хотим услышать, что отличает их наставника от других.
Необходимые критерии для Compass Award:
Видео должно соответствовать стандартам брендинга FIRST и дизайна.
Продолжительность видео не может превышать 60 секунд.
Видео должно быть высокого качества, так как материалы могут быть использованы позже для продвижения FIRST.
Команда должна иметь разрешение от владельцев авторских прав на музыку, используемую в видео.
Музыка и разрешения должны быть указаны в титрах видео.
Видео должно быть отправлено до дедлайна, указанного директором турнира.
Видео подчеркивает вклад наставника в команду и демонстрирует, что отличает их наставника от других.
Judges’ Choice Award
Эта награда является необязательной и может присуждаться не на всех турнирах. Во время соревнований судейская коллегия может встретиться с командой, чьи уникальные усилия, производительность или динамика заслуживают признания, но не подпадают ни под одну из существующих категорий наград. Чтобы отметить эту уникальную команду, FIRST предлагает награду Judges’ Choice Award. Судейская коллегия может выбрать команду, которая будет удостоена чести, а также название Judges’ Choice Award. Judges’ Choice Award присуждается команде за их выдающиеся усилия, но не учитывается в критериях продвижения.
</p>
<p>Winning Alliance Award
Эта награда будет вручена победителю в Альянсе, представленному в финальном матче.
Finalist Alliance Award
Эта награда будет вручена Альянсу-финалисту, представленному в финальном матче.
</p>           
            
           
        </div>
    );
}

export default wardThreeComponent;
